src/cf/DataProcessors/ВводДанныхПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ВводДанныхПациента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диагноз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СхемыЛечений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СхемаЛечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияЭффективности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/РезультатЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РезультатЛечения</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Эффективное</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатЛечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Диагноз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемаЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/СхемаЛеченияКонкретногоПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СхемаЛеченияКонкретногоПациента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РезультатЛечения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СостояниеЗдоровья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗдоровья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЛечения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЛечения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СхемаЛечения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дозировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/ВводДанныхПациента/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СхемыЛеченийВыборПриИзменении(Элемент)  
	
	ТекНомерСтр = Элементы.СхемыЛечений.ТекущиеДанные.НомерСтроки;
	Для каждого Строка из Объект.СхемыЛечений Цикл
		Если Строка.НомерСтроки <> ТекНомерСтр Тогда
			Строка.Выбор = ЛОЖЬ;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура НайтиСхемыЛечения(Команда)
	
	РезультатПроверки = ПроверкаЗаполнения();
	Если РезультатПроверки.Положительный Тогда
		Объект.СхемыЛечений.Очистить();	
		НайтиСхемыЛеченияНаСервере();
	Иначе
		ВывестиОшибки(РезультатПроверки.МассивНезаполненныхПолей);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура НайтиСхемыЛеченияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезультатЛечения.СхемаЛечения КАК Схема,
	               |	ВЫБОР
	               |		КОГДА РезультатЛечения.Эффективное
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КатегорияЭффективности
	               |ИЗ
	               |	РегистрСведений.РезультатЛечения КАК РезультатЛечения
	               |ГДЕ
	               |	РезультатЛечения.Диагноз = &Диагноз";
	Запрос.УстановитьПараметр("Диагноз", Объект.Диагноз);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СхемыЛечений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Функция ПроверкаЗаполнения()
	
	МассивНезаполненныхПолей = Новый Массив;
	СтруктураЗаполнения = ИнициализацияЗаполнения();
	Для каждого Элемент из СтруктураЗаполнения Цикл
		Если НЕ Элемент.Значение Тогда
			 МассивНезаполненныхПолей.Добавить(Элемент.Ключ);
		КонецЕсли;	
	КонецЦикла;	
	
	СтруктураЗаполнения.Вставить("Положительный", МассивНезаполненныхПолей.Количество() = 0); 
	Если  НЕ СтруктураЗаполнения.Положительный Тогда
		 СтруктураЗаполнения.Вставить("МассивНезаполненныхПолей", МассивНезаполненныхПолей);
	КонецЕсли;
	
	Возврат  СтруктураЗаполнения;
	
КонецФункции

&НаСервере
Функция ИнициализацияЗаполнения() 
	
	Структура = Новый Структура;
	Структура.Вставить("Возраст", Объект.Возраст > 0);
	Структура.Вставить("Диагноз", ЗначениеЗаполнено(Объект.Диагноз));
	Структура.Вставить("Противопоказания", СписокИспользуемыхПротивопоказаний.Количество() > 0);
	Структура.Вставить("Симптомы", СписокИспользуемыхСимптомов.Количество() > 0); 
	
	Возврат Структура; 
	
КонецФункции

&НаСервере
Процедура ВывестиОшибки(МассивНезаполненныхПолей)
	
	ВсеОшибки = "";
	Для каждого Элемент из МассивНезаполненныхПолей Цикл
		ВсеОшибки = ВсеОшибки + Элемент + "; "
	КонецЦикла;	  
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Не заполнены поля " + ВсеОшибки;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСхемуЛеченияПациента(Команда)
	
	ОткрытьФорму("Документ.СхемаЛеченияКонкретногоПациента.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура СхемыЛеченийПриИзменении(Элемент) 
	
	ДоступностьКнопкиСозданияДокумента(); 
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьКнопкиСозданияДокумента()  

	Элементы.СоздатьСхемуЛеченияПациента.Доступность = Объект.СхемыЛечений.Количество() > 0;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ДоступностьКнопкиСозданияДокумента();  
	
КонецПроцедуры
